RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_cmp.c
/**
 *******************************************************************************
 * @file  hc32f4a0_cmp.c
 * @brief This file provides firmware functions to manage the Comparator(CMP).
 *
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12        Heqb         First version
   2020-08-31        Heqb         Replace CMP_Delay300ns() with the function DDL_DelayUS()
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_cmp.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_CMP CMP
 * @brief CMP Driver Library
 * @{
 */

#if (DDL_CMP_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CMP_Local_Macros CMP Local Macros
 * @{
 */

/**
 * @defgroup CMP_Check_Parameters_Validity CMP Check Parameters Validity
 * @{
 */

#define IS_CMP_INSTANCE(x)                                                     \
(   ((x) == M4_CMP1)                            ||                             \
    ((x) == M4_CMP2)                            ||                             \
    ((x) == M4_CMP3)                            ||                             \
    ((x) == M4_CMP4))

#define IS_CMP_MODE(x)                                                         \
(   ((x) == CMP_MODE_NORMAL)                    ||                             \
    ((x) == CMP_MODE_WINDOW))

#define IS_CMP_CVSL_CH(x)                                                     \
(   ((x) == CMP_CVSL_NONE)                      ||                             \
    ((x) == CMP_CVSL_INP1)                      ||                             \
    ((x) == CMP_CVSL_INP2)                      ||                             \
    ((x) == CMP_CVSL_INP3)                      ||                             \
    ((x) == CMP_CVSL_INP4))

#define IS_CMP1_CVSL_SOURCE(x)                                                 \
(   ((x) == CMP1_INP3_NONE)                     ||                             \
    ((x) == CMP1_INP3_CMP1_INP3)                ||                             \
    ((x) == CMP1_INP3_CMP2_INP3)                ||                             \
    ((x) == CMP1_INP2_NONE)                     ||                             \
    ((x) == CMP1_INP2_PGA1)                     ||                             \
    ((x) == CMP1_INP2_PGA2)                     ||                             \
    ((x) == CMP1_INP2_CMP1_INP2))

#define IS_CMP3_CVSL_SOURCE(x)                                                 \
(   ((x) == CMP3_INP3_NONE)                     ||                             \
    ((x) == CMP3_INP3_CMP3_INP3)                ||                             \
    ((x) == CMP3_INP3_CMP4_INP3)                ||                             \
    ((x) == CMP3_INP2_NONE)                     ||                             \
    ((x) == CMP3_INP2_PGA3)                     ||                             \
    ((x) == CMP3_INP2_PGA4)                     ||                             \
    ((x) == CMP3_INP2_CMP3_INP2))

#define IS_CMP_RVSL(x)                                                         \
(   ((x) == CMP_RVSL_NONE)                      ||                             \
    ((x) == CMP_RVSL_INM1)                      ||                             \
    ((x) == CMP_RVSL_INM2)                      ||                             \
    ((x) == CMP_RVSL_INM3)                      ||                             \
    ((x) == CMP_RVSL_INM4))

#define IS_CMP_OUT_POLARITY(x)                                                 \
(   ((x) == CMP_OUT_REVERSE_OFF)                ||                             \
    ((x) == CMP_OUT_REVERSE_ON))

#define IS_CMP_OUT_DETECT_EDGE(x)                                              \
(   ((x) == CMP_DETECT_EDGS_NONE)               ||                             \
    ((x) == CMP_DETECT_EDGS_RISING)             ||                             \
    ((x) == CMP_DETECT_EDGS_FALLING)            ||                             \
    ((x) == CMP_DETECT_EDGS_BOTH))

#define IS_CMP_OUT_FILTER(x)                                                   \
(   ((x) == CMP_OUT_FILTER_NONE)                ||                             \
    ((x) == CMP_OUT_FILTER_PCLK3)               ||                             \
    ((x) == CMP_OUT_FILTER_PCLK3_DIV8)          ||                             \
    ((x) == CMP_OUT_FILTER_PCLK3_DIV32))

#define IS_CMP_TIMWIN_FUNC(x)                                                  \
(   ((x) == CMP_TIMERWIN_OFF)                   ||                             \
    ((x) == CMP_TIMERWIN_ON))

#define IS_CMP_TIMWIN_INVALIDLEVEL(x)                                          \
(   ((x) == CMP_TIMERWIN_INVALID_LEVEL_LOW)     ||                             \
    ((x) == CMP_TIMERWIN_INVALID_LEVEL_HIGH))

#define IS_CMP_TIMWIN_OUT_LEVEL(x)                                             \
(   ((x) == CMP_TIMERWIN_OUT_LEVEL_LOW)         ||                             \
    ((x) == CMP_TIMERWIN_OUT_LEVEL_HIGH))
/**
 * @}
 */

/**
 * @}
 */

